; Fichier de localisation française pour devFlowcharter

[CommonParserMessages]
BadCondition=Syntaxe de la déclaration de condition non valide
BadAssign=Syntaxe de la déclaration d'attribution non valide
BadInput=Syntaxe de la déclaration d'entrée non valide
BadOutput=Syntaxe de la déclaration de sortie non valide
BadFunction=Syntaxe de l'appel de fonction non valide
BadFor=Syntaxe ou type de déclaration non valide
BadCase=Syntaxe ou type de déclaration de cas incorrect
BadGeneric=Syntaxe de la déclaration non valide
ExpOk=%s%sDéclaration valide
ExpErr=%s%sERREUR: %s
ExpErrMult=Ligne %d: %s%sERREUR: %s
IntReq=Valeur de l'entier requise
NoCVar=%sERREUR: aucune variable de contrôle spécifiée
BadCVar=%s%sERREUR: variable de contrôle non valide
NoCExp=%sERREUR: aucune déclaration conditionnelle
NoCaseExp=%sERREUR: aucune déclaration de cas
NoInstr=%sWARNING: aucune instruction
NoFCall=%sWARNING: aucun appel de fonction
IncTypes=Types incompatibles: %s et %s
BadFuncParm=Type (%s) d'argument de fonction %s incompatible
BadFuncParmU=Type d'argument de fonction %s incompatible
BreakErr=BREAK non permis ici
ContErr=CONTINUE non permis ici
BadConstOp=Opération sur constante "%s" non valide
BadInOper=Opération d'entrée non valide sur la variable "%s"
BadOperArg=Type (%s) d'argument non valide pour l'opérateur "%s"
UnknId=Identificateur "%s" inconnu
BadFuncParms=Liste d'arguments non valide pour la fonction "%s"
BadCmpr=Comparaison non valide
VarExpct=Identificateur de variable attendu
NoOut=Aucune déclaration de sortie spécifiée
NotPtrType=La variable "%s" n'est pas de type pointeur
BadVarOper=Opération non valide sur la variable "%s"
BadEnumOper=Invalid assignment to enumeration value "%s"
NoTbl=Aucune table déclarée
BadArrExp=Invalid array expression.%s"%s" is not of array type
BadIndx=Invalid array index type (%s)
NotStructType=La variable "%s" n'est pas de type structuré
NoFieldStruct=Le type structuré "%s" ne définit pas le champ "%s"
DupCaseVal=Duplication d'étiquette de cas
BadReturnVal=Invalid return value
BadIndxNumber=Incorrect number (%d) of indexes for array "%s"%sExpected number: %d
BadPtrArray=Invalid pointer operation on array "%s"
UnkFunc=Unknown function "%s"
NotConst=Constant expression expected
SetLenDynArr=Function SetLength is applicable only to dynamic arrays (with no size declared) or variables of string type

[Block]
CaptionTrue=VRAI
CaptionFalse=FAUX
CaptionIn=in
CaptionOut=out
CaptionStart=START
CaptionStop=STOP
CaptionFor=for
CaptionTo=to
CaptionCase=CASE
CaptionExit=RETURN
DefValue=default
WhileTemplate=While %s1 Do
RepeatUntilTemplate=Repeat Until %s1
IfTemplate=If %s1 Then
IfElseTemplate=If %s1 Then
ForDoTemplate=For %s1 from %s2 to %s3
CaseOfTemplate=Case %s1 Of
InputTemplate=%s1
OutputTemplate=%s1
InstrTemplate=%s1
ReturnTemplate=%s1
TextTemplate=%s1
FolderTemplate=Folder 
FunctionCallTemplate=%s1
ElseLabel=Else

[Others]
Ok=Ok
Cancel=Annuler
Confirmation=Confirmer
Error=Erreur
Import=Importer
Row=Ligne
Warning=Avertissement
AttrInfo=[Attribut "%s"]: value incorrecte - "%s"
ValidationError=Erreur de validation
ConvertError=Erreur de conversion
SyntaxError=Erreur de syntaxe
IOError=Erreur d'entrée/sortie
PrintError=Printer Error
DeclareError=Erreur de déclaration
CompileError=Compilation Error
ImportError=Import Error
BadId=Identificateur incorrect.
DupId=Identificateur en double.
BadIdD=Identificateur incorrect
DupIdD=Identificateur en double
DupType=Nom de type en double
DefNtvType=Type "%s" is already defined as native type
DefNtvFunc=Function "%s" is already defined as native function
DupField=Nom de champ en double
OkIdD=Identificateur valide
BadSize=Taille incorrecte.
BadVarSize=La variable "%s" n'a pas  la bonne taille : %s
IncorrectIdKeyword=Identificateur incorrect. "%s" est mot clé %s.
BadCVal=Valeur incorrect de constante.
NoPrinter=Il n'y a pas d'imprimante installée.
ExeFilesFilter=Fichiers exécutables (*.exe;*.bat;*.cmd)|*.exe; *.bat; *.cmd;
LngFilesFilter=Fichiers de translation (*.lng)|*.lng;
RTFFilesFilter=Documents Rich Text (*.rtf)|*.rtf;
BMPFilesFilter=Fichiers BMP (*.bmp)|*.bmp;
JPGFilesFilter=Fichiers JPEG (*.jpg)|*.jpg;
PNGFilesFilter=PNG files (*.png)|*.png;
XMLFilesFilter=Fichiers XML (*.xml)|*.xml;
HTMLFilesFilter=Fichiers HTML (*.html)|*.html;
TextFilesFilter=Fichiers texte (*.txt)|*.txt;
SourceFilesFilter=Fichiers %s (*.%s)|*.%s;
ConfirmClose=Enregistrer les changements au projet %s?
ImportFailed=L'importation n'a pas réussi.%s%s
Functions=Fonctions
Structures=DataTypes
Function=Fonction
Procedure=Procedure
TagNotFound=Ne peut trouver l'étiquette du bloc principal
ChangeLngAsk=Le projet ŕ ouvrir a été crée en %s.%sVoulez-vous choisir cette langue?
ChangeLngNone=Project that is being opened was created as plain flowchart.%s%sDo you want to switch to plain flowcharts?
RegErr=Une erreur est survenu lors de l'enregistrement des paramètres de l'application.
BadImportTag=Bloc importé introuvable ou de type incorrect.
Unknown=inconnu
NoType=aucun
Modified=Modifié
Default=par défaut
NameTagNotFound=<Name> tag not found or is empty.
FileError=Error while reading file %s.
ParserError=XML parser error #%d at line %d, column %d: %s
OpenError=Une erreur est survenue ŕ l'ouverture du fichier %s:%s%s
SaveReadOnlyFile=Le fichier %s est en lecture seulement et ne peut ętre ré-écrit.
SaveError=Une erreur est survenue ŕ l'écriture du fichier %s:%s%s
HeaderRequest=Entrez l'en-tęte:
PrinterError=Une erreur est survenue ŕ l'impression:%s%s.
PageCount=Page %d/%d
ColumnCount=Colonne %d/%d
RowCount=Ligne %d/%d
OtherException=%sCurrent project will be saved and closed.
CloseProjectAsk=Changing some settings requires the current project to be closed.%sDo you want to apply these changes?
StatusBarInfo=Ligne %d, Col %d
InsertMode=Insérer
OverwriteMode=Ecraser
CompilerNotFound=Undefined compilation command for %s.
CompileFail=La tentative de compilation n'a pas fonctionnée.
RunFail=La tentative d'exécution n'a pas fonctionnée.
NoFileToRun=Ne peut trouver l'exécutable %s.
VarLocal=local
VarParm=function parameter
HintVar=%s variable   %s: %s
HintArray=%s %d-dimensional array   %s%s: %s
HintArrayExp=After expanding %s type:%s%s %d-dimensional array   %s%s: %s
HintConst=constante   %s = %s
HintRoutine=procedure/function   %s: %s
HintEnum=enumerated value   %s: %s
chkAddPtrType=Ajouter type de pointeur
btnAddField=Ajouter champ
btnAddValue=Add Value
Body=Flowchart
lblBodyPage=Tab:
mainPage=main
lblName=Nom:
lblType=Type:
lblSize=Size:
lblField=Field:
lblValue=Value:
lblRetType=Type de renvoi:
lblLibrary=Bibliothčque:
lblParam=Identificateur:
lblParamType=Type:
lblParamDefault=Default:
lblParamArray=Table:
lblParamRef=Réf:
btnAddParm=Ajouter un paramètre
edtLibraryHint=External %s library containing item declaration
RootNodeText=PROJET %s
miFoldTrue=Fold
miFoldFalse=Unfold
lblErrors=Erreurs: %d
lblWarnings=Avertissements: %d
MainProgram=Main Program
LocalDeclare=Local Variables
Header=Header
Params=Formal Parameters
btnAdd=Ajouter
btnImport=Import
btnExport=Export
btnChange=Changer
btnRemove=Enlever
sgVarListCol0=Name:
sgVarListCol1=Type:
sgVarListCol2=Taille:
sgVarListCol3=Initial Value:
sgVarListCol4=External:
sgConstListCol0=Name:
sgConstListCol1=Valeur:
sgConstListCol2=External:
edtSizeHint=Examples of valid size declaration:##1 - variable##[100] - array##[ARRAY_SIZE+1] - array where ARRAY_SIZE is global constant of integer type##[100][100] - 2-dimensional array##[ ] - unbounded or dynamic array (if allowed by language)##[ ][ ] - 2-dimensional unbounded array
gbVariable=Variable
gbConstant=Constante
InstanceVars=Instance Variables
InstanceConstants=Constants
GlobalVars=Global Variables
GlobalConsts=Global Constants
GlobalDeclares=Déclarations
ConfirmRemove=This operation cannot be undone. Are you sure to continue?
BadInitVal=Incorrect initial value.
rgTypeBox=Kind:
dtInt=Integer
dtReal=Real
dtRecord=Record
dtCustom=Custom
dtEnum=Enumeration
dtOther=Other
dtArray=Array
lblPrefix=Add Prefix:
gbDesc=Description/Prefix
chkInclDescCode=Include into code
chkInclDescFlow=Include into flowchart label
Flowchart=Flowchart
LngNoSprt=%s language is not supported by this instance of devFlowcharter.
OldVerMsg=This project was created in newer version (%s) of devFlowcharter. It may not have been imported correctly.
EnterPage=Tab name:
Page=Tab
Visible=Visible
chkExternal=Déclaration externe
chkExternal.Hint=Excludes from code generation
ImportFunc=Import Functions
ImportType=Import Data Types
Consts=constants
Vars=variables
chkArrayType=array
constructor=constructor
DisableFieldValid=Validation of this field can be disabled in Options->Settings (section Others)
NoProgTempl=Cannot generate source code:%sDefinition file for %s (%s) does not contain tag %s or this tag is empty.
CodeGenErr=Error during code generation:%s%s
btnGenDesc=Generate
OverMaxPPI=Pixels Per Inch value for current display (%d) is above maximum supported by application (%d).%sFlowchart and various UI items may be displayed incorrectly.
argHintStr=You can reorder parameters by dragging them with the mouse
fieldHintStr=You can reorder fields by dragging them with the mouse
LoadTranslFail=Failed to load translation from %s file.%sLoading default translation.

; The following keys (4 for each programming language) are used to display labels next to flowcharts. Example is example language as defined in ../LanguageDefinitions/Example.xml file.

; Key ProcedureLabelExample 
; Available placeholders: %s1 - procedure name; %s2 - parameters list, %s4 - procedure description, %s6 - external modifier, ## - new line
ProcedureLabelExample=%s6procedure %s1(%s2)##%s4

; Key ConstructorLabelExample 
; Available placeholders: %s1 - constructor name; %s2 - parameters list, %s3 - return type (created object type), %s4 - constructor description, %s6 - external modifier, ## - new line
ConstructorLabelExample=constructor %s6%s1(%s2)##%s4

; Key FunctionLabelExample 
; Available placeholders: %s1 - function name; %s2 - parameters list; %s3 - function return type, %s4 - function description, %s5 - array return type modifier, %s6 - external modifier, ## - new line 
FunctionLabelExample=%s6function %s1(%s2): %s3##%s4


; Key ProgramLabelExample
; Available placeholders: %s1 - name of the project
ProgramLabelExample=program %s1

ProcedureLabelPascal=procedure %s1(%s2)##%s4
FunctionLabelPascal=function %s1(%s2): %s3##%s4
ProgramLabelPascal=Main Program
ConstructorLabelPascal=constructor %s1(%s2)##%s4

ProcedureLabelC=void %s1(%s2)##%s4
FunctionLabelC=%s3%s5 %s1(%s2)##%s4
ProgramLabelC=int main

ProcedureLabelTiBasic=Prgm %s1(%s2)##%s4
FunctionLabelTiBasic=Func %s1(%s2)##%s4
ProgramLabelTiBasic=Prgm %s1

ProcedureLabelPython=function %s1(%s2)##%s4
FunctionLabelPython=function %s1(%s2)##%s4
ProgramLabelPython=main program %s1

ProcedureLabelJava=%s4##%s6void %s1(%s2)
FunctionLabelJava=%s4##%s6%s3%s5 %s1(%s2)
ProgramLabelJava=void main(String[] args)
ConstructorLabelJava=%s4##constructor %s6 %s1(%s2)

[MainForm]
miFile=Fichier
miProject=Projet
miOptions=Options
miNew=Nouveau
miOpen=Ouvrir...
miReopen=Réouvrir
miSave=Enregistrer
miSaveAs=Enregistrer sous...
miClose=Fermer
miPrint=Imprimer...
miPrint2=Imprimer...
miExit=Sortir
miDataTypes=Data Types
miSubRoutines=Fonctions
miDeclarations=Déclarations
miExplorer=Explorateur
miNavigator=Navigator
miAddMain=Add Main Program
miUndoRemove=Annuler Enlever
miGenerate=Générer le code
miToolbox=Boîte ŕ outils
miSettings=Paramètres
miManual=Aide
miAbout=Ŕ propos de
miInsert=Insérer
miNewFlowchart=Organigramme
miNewFunction=New Function
miFont=Police
miRemove= Enlever
miRemove.Hint=You can also remove selected block by pressing Delete key
miCut=Couper
miCut.Hint=You can also cut/paste block by drag-and-drop
miCopy=Copier
miCopy.Hint=You can also copy/paste block by drag-and-drop with Shift key pressed
miInstrs=Instructions
miLoop=Boucle
miRoutineCall=Appel de fonction
miComment=Commentaire
miPaste=Coller
miInstr=Instruction
miMultiInstr=Multiple Instructions
miInput=Entrée
miOutput=Sortie
miIf=If
miIfElse=If..Else
miReturn=Return
miReturn.Hint=Possible to insert only as a last instruction within a compound statement.
miFor=For
miWhile=While
miRepeat=Repeat
miCase=Case
miFontStyle=Style
miFontSize=Taille
miStyleNormal=Normal
miStyleBold=Gras
miStyleItalic=Italique
miStyleUnderLine=Souligné
miStyleStrikeOut=Barré
miStyleStrikeOut.Hint=Setting strikeout style exclude block from code generation.
miFrame=Cadre
miFrame.Hint=When block is selected you can enable/disable frame either with F11 key or by LMB double click
miFoldUnfold.Hint=You can also fold/unfold block with F12 key
miExpandBlock=Agrandir
miAddBranch=Ajouter une valeur de cas       
miRemoveBranch=Enlever branche
miInsertBranch=Insert Case Branch
miUnfoldAll=Unfold All
miUnfoldAll.Hint=You can also unfold all blocks with F10 key when block is selected
miText=Text
miFolder=Folder
miFolder.Hint=Block containing multiple blocks inside.
SaveDialog=Fichiers XML (*.xml)|*.xml;
OpenDialog=Fichiers XML (*.xml)|*.xml;
miExport=Exporter...
miImport=Importer...
miMemo=Memo
miMemoEdit=Edit Text
miMemoVScroll=Vertical ScrollBar
miMemoHScroll=Horizontal ScrollBar
miMemoWordWrap=Word Wrap
miMemoAlignRight=Align Right
miAddPage=Add
miRemovePage=Remove
miRenamePage=Rename
miUndo=Undo
miCut1=Cut
miCopy1=Copy
miPaste1=Paste
miRemove1=Remove
miInsertFunc=Insert Function
miIsHeader=Program Header
miPasteText=Paste

[DeclarationsForm]
FormCaption=Déclarations

[SettingsForm]
FormCaption=Paramètres
gbCompilers=Compilateurs
gbProgLang=Programming Language
gbTranslation=Application Language
gbEditor=Éditeur de Code
gbEditorColors=Couleurs
gbMisc=Autres
gbPrint=Imprimer
lblCompiler=Compiler command:
lblCompilerNoMain=Compiler command for no-main projects:
lblFile=Translation file:
chkParseAssign=Attribution
chkParseMultiAssign=Attributions multiples
chkParseCondition=Déclaration conditionnelle
chkParseFor=Boucle «For»
chkParseCase=Déclaration de cas
chkParseOutput=Instruction de sortie
chkParseInput=Instruction d'entrée
chkParseRoutine=Appel de fonction
chkParseReturn=Return instruction
chkConfirmRemove=Confirm irreversible removals
lblIndent=Indentation:
lblEditorFont=Police:
lblEditorBkg=Arričre plan:
lblEditorActiveLine=Ligne active:
lblEditorGutter=Gouttičre:
lblEditorDigit=Nombres:
lblEditorString=Chaînes:
lblEditorSelect=Sélection:
lblEditorComment=Commentaires:
lblEditorIdent=Identifiers:
lblEditorKeyword=Keywords:
lblDesktop=Bureau:
lblSelectColor=Sélection:
lblFontColor=Police:
lblPenColor=Pen:
gbFlowchart=Organigramme
chkEnableDBuffer.Caption=Double buffering
chkEnableDBufferHint=Eliminates flickering while drawing flowchart##Decreases scrolling performance for big flowcharts
chkShowFuncLabels=Show flowchart labels
chkShowBlockLabels=Show block labels
btnDefault=Paramètres par défaut
btnBrowseCompilers=Parcourir...
btnBrowseTranslations=Parcourir...
btnSave=OK
btnDiscard=Annuler
chkMultiPrint=Imprimer sur plusieurs pages
chkMultiPrintHorz=Imprimer sur plusieurs pages dans le sens horizontal
gbPrintMargins=Marges (en pour cent)
lblMarginLeft=Gauche:
lblMarginRight=Droit:
lblMarginTop=Haut:
lblMarginBottom=Bas:
edtCompilerHint=Available placeholders:##%s1 - saved source file name##%s2 - saved source file name without extension##Example command:##cmd.exe /k C:\SomeCompiler\bin\compile.bat "%s1"
edtCompilerNoMainHint=Available placeholders:##%s1 - saved source file name##%s2 - saved source file name without extension##%s3 - standard compiler command
chkValidateConsts=Enable additional validation for declarations
chkAutoUpdateCode=Auto-update code for project changes
lblFontSize=Font size:
pnlFont.Hint=It can be neither red nor olive
pnlSelect.Hint=It must be different than desktop color
lblFileEncoding=Files encoding:
edtFontNameSize=font name : font size
cbIndentChar.0=space
cbIndentChar.1=tab

[ExplorerForm]
FormCaption=Explorateur
miNextError=Erreur/avertissement suivant
miPrevError=Erreur/avertissement précédent
miExpand=Agrandir tous
miCollapse=Réduire tous
miRemove=Enlever
miRefresh=Rafraîchir
miRebuild=Rebuild
chkAutoNav=Enable auto-navigation

[EditorForm]
FormCaption=Éditeur de code
miProgram=Programme
miSave=Enregistrer...
miCompile=Compiler...
miRun=Exécuter
miPrint=Imprimer...
miEdit=Édition
miFind=Rechercher...
miReplace=Replacer...
miGoto=Aller ŕ...
miView=Voir
miStatusBar=Barre d'état
miScrollbars=Barres de défilement
miGutter=Gouttičre
miCodeFolding=Code Folding
miCodeFoldingEnable=Enable
miCollapseAll=Collapse All
miUnCollapseAll=Expand All
miIndentGuides=Indent Guides
miRichText=Highlight Code
miRegenerate=Régénérer
miRegenerate.Hint=Regenerates code, keeping your comments and added lines
miRegenerateFromScratch=Regenerate from scratch
miRegenerateFromScratch.Hint=Regenerates code, discarding all your changes
miHelp=Aide
miUndo=Annuler
miRedo=Refaire
miCut=Couper
miCopy=Copier
miCopyRichText=Copier spécial
miPaste=Coller
miPasteComment=Coller comme commentaire
miRemove=Enlever
miSelectAll=Sélectionner tout
Modified=Modifié
InsertMode=Insérer
OverwriteMode=Ecraser
miFindProj=Find in Project
miFindProj.Hint=Find in Project works with text selection and cursor position

[GotoForm]
FormCaption=Aller ŕ
rbLine=Ligne
rbNextBookmark=Signet suivant
rbPrevBookmark=Signet précédent
btnGoTo=Ok

[FunctionsForm]
FormCaption=Fonctions
miAction=Fonction
miAdd=Ajouter
miRemove=Enlever
miRemoveAll=Enlever Tout
miImport=Importer...
miExport=Exporter...
miExportAll=Exporter Tout...

[DataTypesForm]
FormCaption=Data Types
miAction=Data Type
miAdd=Ajouter
miRemove=Enlever
miRemoveAll=Enlever Tout
miImport=Importer...
miExport=Exporter...
miExportAll=Exporter Tout...

[HelpForm]
FormCaption=éditeur de code - Aide
EditorHelp1=Touches:
EditorHelp2=
EditorHelp3=Combinaison:    Action:
EditorHelp4=-------------------------------------------------------
EditorHelp5=Ctrl-Y          Enlever ligne
EditorHelp6=Ctrl-A          Sélectionner tout
EditorHelp7=Ctrl-C          Copier
EditorHelp8=Ctrl-X          Couper
EditorHelp9=Ctrl-V          Coller
EditorHelp10=Ctrl-Z          annuler
EditorHelp11=Ctrl-Home       Aller ŕ la premičre ligne
EditorHelp12=Ctrl-End        Aller ŕ la derničre ligne
EditorHelp13=Shift-Ctrl-Z    Refaire
EditorHelp14=Shift-Ctrl-B    Trouver parenthčse correspondante
EditorHelp15=Shift-Ctrl-I    Déplacer bloc sélectionné ŕ la droite
EditorHelp16=Shift-Ctrl-U    Déplacer bloc sélectionné ŕ la gauche
EditorHelp17=Shift-Ctrl-C    Passer ŕ la sélection par colonne
EditorHelp18=Shift-Ctrl-L    Passer ŕ la sélection par ligne
EditorHelp19=Shift-Ctrl-N    Passer ŕ la sélection normale
EditorHelp20=
EditorHelp21=Astuces:
EditorHelp22=-------------------------------------------------------
EditorHelp23=• To copy comment from flowchart area to editor window,
EditorHelp24="  hold Shift and drag comment to editor."
EditorHelp25=• To generate code for single function or data type,
EditorHelp26="  drag its tab name to editor window."
EditorHelp27=• To generate code for single block, select it and drag
EditorHelp28="  to editor."
EditorHelp29=• To select code when switching function/datatype tabs
EditorHelp30="  on their form, hold Ctrl key."
EditorHelp31=• To select/deselect code when highlighting flowchart
EditorHelp32="  block, hold Ctrl key."

[ToolBoxForm]
FormCaption=ToolBox
sbInstr=Instruction
sbMultiInstr=Multiple Instructions
sbIf=If
sbIfElse=If..Else
sbInput=Entrée
sbOutput=Sortie
sbFor=For
sbRepeat=Repeat
sbWhile=While
sbFuncCall=Appel de fonction
sbCase=Case
sbReturn=Return
sbFolder=Folder
sbText=Text

[NavigatorForm]
FormCaption=Navigator

[AboutForm]
FormCaption=Ŕ propos de

[MemoEditorForm]
FormCaption=Memo Editor
btnOK=OK
btnCancel=Cancel

[SelectImportForm]
btnOK=OK
btnCancel=Cancel
chkSelectAll=Select All


